const questions = `1._____ У моєму житті не було людей, які б розуміли і відповідали на мої емоційні потреби. 
2._____ Я не отримав (-ла) достатньо любові та уваги. 
3._____ Здебільшого, у мене не було нікого, хто б дав мені пораду, або підтримав емоційно. 
4. _____ Переважно у мене не було нікого, хто б турбувався про мене, з ким я б міг розділити свій внутрішній світ, хто б щиро цікавився тим, що зі мною відбувається. 
5._____ Більшу частину мого життя у мене не було нікого, хто б хотів мати зі мною близькі стосунки і проводити зі мною багато часу. 
6._____ Здебільшого в мене не було нікого, хто б давав тепло, підтримку і любов. 
7._____ Більшу частину мого життя я не відчував (-ла), що я є особливим (-ою) для когось. 
8._____ Здебільшого в мене не було нікого, хто б справді слухав мене, розумів мене або був зацікавлений моїми справами чи почуттями. 
9._____ Дуже рідко у моєму житті був хтось, хто міг би дати мені добру пораду чи підказку, коли я не був (-ла) впевнений (-а), що робити. 
*ed 
10._____ Я переживаю, що люди, яких я люблю, скоро помруть, навіть якщо не має загроз їх здоров’ю та благополуччю з медичної точки зору. 
11._____ Я помічаю, що «прилипаю» до близьких мені людей тому, що боюся, що вони покинуть мене.  
12._____ Я переживаю, що близькі мені люди покинуть/відкинуть мене. 
13._____ Я відчуваю, що мені не вистачає джерела стабільної емоційної підтримки. 
14._____ Я не вважаю, що важливі стосунки триватимуть довго, я очікую, що вони завершаться. 
15._____ Я почуваюсь узалежним (-ою) від стосунку з людьми, які не можуть справді зобов’язатися до тривалих, відповідальних стосунків зі мною. 
16._____ Зрештою, я все одно буду один (-на). 
17._____ Коли я відчуваю, що хтось, кого я люблю, віддаляється від мене, я впадаю у відчай. 
18._____  Інколи я настільки переживаю, що люди покинуть мене, що сам (-а) відкидаю їх. 
19._____ Я засмучуюсь, коли хтось залишає мене самого (-у), навіть на короткий проміжок часу. 
20. _____ Я не можу розраховувати на людей, якщо вони не можуть бути постійно присутніми у моєму житті – регулярної присутності мені замало. 
21._____ Я не можу дозволити собі сильно зближуватись з іншими людьми тому, що я не впевнений (-а), що цей стосунок буде стійким і вони завжди будуть поруч. 
22._____ Виглядає так, що важливі люди в моєму житті завжди приходять і відходять. 
23._____ Я дуже переживаю, що люди, яких я люблю, знайдуть когось іншого, хто їм буде подобатись більше, ніж я, і покинуть мене.  
24._____ Близькі мені люди завжди були дуже непередбачуваними: в один момент вони поряд зі мною, привітні, а в інший – вони розгнівані, засмучені, егоцентричні та конфліктні. 
25.  _____ Я настільки потребую інших людей, що переживаю, що втрачу їх. 
26.  _____Я не можу бути собою чи виявляти, що я насправді відчуваю, інакше важливі для мене люди покинуть мене. *ab 
27._____ Я вважаю, що люди мають намір використати мене задля власних потреб. 
28._____ Я часто відчуваю, що повинен (-на) захищати себе  від інших. 
29._____ Я відчуваю, що не можу втрачати пильність в присутності інших людей, інакше вони навмисно зроблять мені боляче. 
30._____ Якщо хтось добре до мене ставиться, то я припускаю, що він/вона має якісь приховані наміри. 
31._____ Мене обов’язково хтось зрадить, це лиш питання часу. 
32._____ Більшість людей думають тільки про себе. 
33._____ Я маю великі труднощі з довірою до людей. 
34._____ Я часто маю підозри щодо мотивів інших людей. 
35._____ Люди дуже рідко є чесними; вони зазвичай не є тими, за кого себе видають. 
36._____ Зазвичай я шукаю приховані мотиви у діях людей щодо мене. 
37._____Якщо я думаю, що хтось збирається завдати мені болю, то намагаюся завдати болю першим (-ою). 
38._____ Як правило, я повинен (-на) ретельно перевірити людей перед тим, як зможу їм довіряти 
39._____ Я влаштовую «перевірки» іншим людям, щоб переконатися в тому, що вони говорять правду і мають добрі наміри. 
40. _____ Я живу за правилом «Контролюй інших, інакше вони контролюватимуть тебе». 
41._____ Я починаю злитись, коли думаю про те, як жорстоко зі мною поводилися люди в моєму житті.
42._____ У моєму житті близькі мені люди використовували мене задля досягнення власних цілей чи задоволення власних потреб. 
43._____ Я зазнав (-ла) фізичного, емоційного або сексуального насильства збоку важливих людей в моєму житті. 
*ma 
44._____ Я не такий (-а) як всі. 
45._____ Я абсолютно відрізняюсь від інших людей. 
46._____ Я нікому не належу; я самітник. 
47._____ Я почуваюся відчуженим (-ою) від інших людей. 
48._____ Я почуваюся ізольованим (-ою) і самотнім (-ьою). 
49._____ Я завжди почуваюся поза групою. 
50._____ Ніхто по-справжньому мене не розуміє. 
51._____ Моя сім’я завжди відрізнялась від сімей навколо нас. 
52._____ Інколи я почуваюсь інопланетянином. 
53._____ Якщо мене завтра не стане, то ніхто цього не помітить. 
*si 
54._____ Жоден (-на) чоловік/жінка, з якою я хочу бути, не зможе розвивати подальші стосунки і хотіти бути зі мною, якщо дізнається про мої недоліки і вади.  
55._____ Ніхто, хто мені дуже подобається, не залишився б поруч зі мною, якби пізнав мене справжнього (-ю). 
56._____ За своєю суттю я недосконалий (-а) і дефективний (-а). 
57._____ Немає значення скільки я стараюсь, я відчуваю що мені не вдасться здобути достойного (-у) чоловіка/жінку, який (-а) би поважав мене і вважав (-ла) мене цінним (-ою). 
58._____ Я недостойний (-на) любові, поваги та уваги від інших. 
59._____ Я відчуваю, що я невартий (-а) любові. 
60._____ Я є людиною, яку неможливо прийняти такою, якою вона є – тож я не можу відкриватися перед іншими людьми. 
61._____ Якби люди дізналися про мої основні недоліки, то я не міг (могла) б дивитися їм в очі. 
62._____ Коли я подобаюсь людям, то почуваюся так, ніби я їх обманюю. 
63._____ Я часто помічаю, що мене тягне до людей, які критикують або відкидають мене. 
64._____ У мене є особисті таємниці і я не хочу, щоб близькі люди дізнались про них. 
65._____ Це моя вина, що батьки не любили мене достатньою мірою. 
66._____ Я не дозволяю людям пізнати мене справжнього (-ю). 
67._____ Один з найбільших страхів це той, що мої недоліки будуть виявлені. 
68._____ Я не можу зрозуміти, як хтось може мене любити. 
*ds 
69._____ Майже нічого з того, що я роблю на роботі (чи в навчанні), я не роблю настільки добре, як це можуть зробити інші люди. 
70._____ Я некомпетентний (-а), коли мова йде про досягнення у праці чи навчанні. 
71._____ Інші люди є більш здібними від мене у сфері роботи (чи навчання) тому й вони можуть чогось, на відміну від мене, досягнути у житті. 
72._____ Я невдаха. 
73._____ Я не настільки талановитий (-а) в роботі (чи навчанні), як інші люди. 
74._____ Я не настільки розумний (-а), як інші люди, якщо мова йде про роботу (чи навчання). 
75._____ Я почуваюся приниженим (-ою) через мої недоліки та невдачі на роботі (у навчанні). 
76._____ Мені часто соромно знаходитись поряд з іншими людьми,тому що я не рівня їм за тим, чого досяг у житті. 
77._____ Я часто порівнюю мої досягнення з досягненнями інших людей і відчуваю, що інші люди набагато успішніші за мене. *fa 
78._____ Я не відчуваю, що здатний (-а) самостійно давати собі раду у повсякденному житті. 
79._____ Я потребую інших людей, щоб справлятися зі всім. 
80._____ Я не відчуваю, що можу впоратися самостійно з вимогами щоденного життя. 
81._____ Я переконаний (-а), що інші люди можуть краще потурбуватися про мене, ніж я сам (-а) про себе.  
82._____ Мені важко братися за нові завдання поза роботою, якщо поряд не буде когось, хто б мене супроводжував. 
83._____ Я вважаю себе особою, залежною від інших, якщо мова йде про щоденне функціонування. 
84._____ Я псую все, за що беруся, навіть поза межами роботи (навчання). 
85._____ Я нездібний (-а) у більшості сферах мого життя. 
86._____ Якщо я покладатимусь на власний розсуд у повсякденних ситуаціях, то прийму неправильне рішення. 
87._____ Мені не вистачає практичних знань та вмінь необхідних для щоденного життя. 
88._____ Я не можу покладатися на власні судження в щоденних ситуаціях. 
89._____ Я не маю впевненості у своїй здатності вирішувати щоденні проблеми, які виникають.
90._____ Я відчуваю, що потребую когось, на кого можу покластися, хто б давав мені поради у практичних питаннях. 
91._____ Я відчуваю себе більше дитиною, ніж дорослим, коли йдеться про виконання повсякденних обов’язків. 
92._____ Для мене давати собі раду самостійно з викликами та завданнями щоденного життя є надто великим стресом. 
*di 
93._____ Я не можу позбутися відчуття, що має трапитись щось погане.  
94._____ Я відчуваю, що катастрофа (природня, кримінальна, фінансова або зі здоров'ям) може трапитись в будь-який момент. 
95._____ Я переживаю, що можу стати безхатченком, опинитися на вулиці.  
96._____ Я переживаю, що на мене хтось нападе. 
97._____ Я вдаюся до значних запобіжних заходів, щоб уникнути хвороби чи травм, нещасних випадків. 
98._____ Я переживаю, що у мене розвивається серйозна хвороба, навіть попри те, що нічого серйозного лікарі не виявили при обстеженні. 99._____ Я є ляклива людина. 
100.____ Я занадто хвилююсь про погані речі, які відбуваються у світі: злочини, забруднення навколишнього середовища і т.п. 
101.____ Я переживаю, що можу зійти з розуму. 
102.____ Я переживаю, що в мене буде панічна атака. 
103.____ Я часто переживаю, що в мене може бути серцевий напад або рак, навіть якщо для цього існують дуже незначні медичні підстави. 
104.____ Я відчуваю, що світ є небезпечним місцем. 
*vu 
105.____ Я не був (-ла) в змозі відокремитись від батьків так, як це зробили інші люди мого віку.  
106.____ Як мої батьки, так і я, ми маємо тенденцію до того, щоб надмірно перейматися життям та проблемами одні одних. 
107.____ Мені та моїм батькам дуже важко приховувати інтимні подробиці одні від одних, не відчуваючи себе винними або зрадженими.  
108.____ Моїм батькам та мені потрібно розмовляти одні з одними майже щодня, інакше хтось з нас почуватиметься винним, зраненим, розчарованим або самотнім. 
109.____ Я часто відчуваю, що не маю відокремленої ідентичності від моїх батьків чи від мого партнера. 
110.____ Я часто відчуваю, що мої батьки визначають моє життя – і я не маю власного. 
111.____ Мені дуже важко утримувати будь-яку дистанцію в стосунку з близькими мені людьми; мені складно в будьякий спосіб відчувати себе осібною людиною. 
112.____ Я настільки відчуваю себе пов’язаним (-ою) з моїм партнером чи батьками, що мені важко відділити себе від них, визначити, ким я є сам по собі і чого хочу. 
113.____ Мені важко відокремити мою точку зору чи думку від точки зору моїх батьків чи партнера. 
114.____ Я часто відчуваю, що в стосунку з батьками чи моїм партнером не існує межі, яка би відділяла простір мого приватного життя – щодо них у мене немає жодних кордонів. 
115.____ Я відчуваю, що моїм батькам є або було б дуже боляче, якби я жив (-ла) своїм життям, далеко від них. 
*eu 
116.____ Я дозволяю іншим людям, щоб було так, як вони хочуть, тому що я боюся наслідків. 
117.____ Я вважаю, що якщо я роблю те, що хочу, то цим самим просто напрошуюсь на неприємності. 
118.____ Я думаю, що в мене немає вибору і я змушений (-а) задовольняти бажання інших, інакше вони мене відкинуть. 119.____ У стосунках я надаю іншій особі право вирішального голосу у прийнятті рішень. 
120.____ Я завжди дозволяв (-ла) іншим приймати рішення за мене, тож я дійсно не знаю, чого хочу для себе. 
121.____ Я відчуваю, що важливі рішення в моєму житті не були справді прийняті мною. 
122.____ Я постійно намагаюся догодити людям, щоб вони не відкинули мене. 
123.____ Для мене є великою трудністю вимагати, щоб мої права поважали, а також, щоб зважали на мої почуття.  124.____ Я невиразно виявляю людям своє незадоволення замість того, щоб прямо проявити свою злість чи незадоволення. 
125.____ Я прикладаю набагато більше зусиль, ніж інші люди, щоб уникнути прямої суперечки/конфронтації з іншими людьми. *sb 
126.____ Я ставлю потреби інших вище від своїх, бо інакше я почуватимусь винним (-ою). 
127.____ Я почуваюся винним (-ою), коли засмучую або розчаровую інших. 
128.____ Я більше віддаю людям, ніж отримую взамін. 
129.____ Вкінці-кінців, зазвичай, на мене лягає турбота про близьких людей.
130.____ Не існує майже нічого, чого б я не міг (могла) терпіти, якщо я когось люблю. 
131.____ Я є доброю людиною, тому що турбуюсь про інших більше ніж, про себе. 
132.____ На роботі я, зазвичай, добровільно виконую додаткові завдання в позаробочий час. 
133.____ Не має значення, наскільки я зайнятий (-а), я завжди знайду час для інших. 
134.____ Я можу жити на мінімальних засобах для існування, бо мої потреби дуже незначні.  
135.____ Я щасливий (-а) лише тоді, коли всі навколо мене щасливі. 
136.____ Я настільки зайнятий (-а) турботою про інших, що майже не маю часу для себе. 
137.____ Я завжди вислуховую проблеми інших. 
138.____ Мені комфортніше дарувати подарунки, ніж отримувати. 
139.____ Інші люди вважають, що я занадто багато роблю для інших, і недостатньо для себе. 
140.____ Незалежно від того, скільки я даю, я завжди відчуваю, що це недостатньо. 
141.____ Якщо я роблю те, що хочу, то почуваюся некомфортно. 
142.____ Мені дуже важко просити інших турбуватися про мої потреби. 
*ss 
143.____ Я переживаю, що втрачу контроль над своїми діями. 
144.____ Я переживаю, що можу завдати комусь серйозної фізичної або емоційної шкоди, якщо мій гнів вийде з-під контролю. 
145.____ Я вважаю, що повинен (-на) контролювати свої емоції та імпульси, інакше трапиться щось погане. 
146.____ В мені є багато гніву і почуття образи, яких я не виявляю. 
147.____ Я занадто сором’язливий (-а), щоб показувати свої позитивні почуття до інших (напр., прихильність, турботу). 
148.____ Мені соромно висловлювати свої почуття до інших. 
149.____ Мені важко бути теплим (-ою) і спонтанним (-ою). 
150.____ Я настільки контролюю себе, що люди думають, що я неемоційний (-а). 
151.____ Люди вважають мене емоційно скутим (-ою). 
*ei 
152.____ Я повинен (-на) бути найкращим (-ою) в тому, що роблю; «друге місце» неприйнятне для мене. 
153.____ Я намагаюся тримати все в ідеальному порядку. 
154.____ Я постійно мушу виглядати якнайкраще. 
155.____ Я намагаюсь робити все якнайкраще; мені замало, щоб було просто “достатньо добре”. 
156.____ Мені потрібно стільки всього зробити, що зовсім не залишається часу для відпочинку. 
157.____ Нічого з того, що я роблю, не є достатньо добрим; я завжди можу зробити краще. 
158.____ Я повинен (-на) виконувати всі свої обов’язки. 
159.____ Я відчуваю на собі постійний тягар обов’язків та справ, які маю завершити на належному рівні. 
160.____ Мої стосунки страждають, тому що я надто багато часу приділяю виконанню своїх обов’язків. 
161.____ Я настільки хочу зробити все добре, а тому перепрацьовую, що це відображається на моєму здоров’ї. 162.____ Я  часто жертвую своїм щастям та задоволенням, задля того, щоб довести справи до належного рівня виконання. 
163.____ Коли я помиляюсь, то заслуговую на сувору критику. 
164.____ Я не можу так легко звільнити себе від відповідальності чи пробачити собі свої помилки. 
165.____ Я дуже конкурентна особистість.  
166.____ Я надаю велике значення грошам і статусу. 
167.____ Судячи по моїй поведінці, я завжди повинен (-на) бути «номер один». 
*us 
168.____ Мені дуже важко прийняти відповідь “ні”, коли я когось про щось прошу. 
169.____ Мене часто злять або дратують ситуації, коли я не можу отримати те, чого хочу. 
170.____ Я особливий (-а), і тому на мене не поширюються багато обмежень і заборон, які накладаються на інших людей. 
171.____ Я ненавиджу, коли мене обмежують або не дають мені робити те, що я хочу. 
172.____ Я вважаю, що не повинен (-на) дотримуватись певних правил чи норм так, як це роблять інші люди.  
173.____ Я вважаю, що те, що можу запропонувати я, є ціннішим від того, що можуть запропонувати інші. 
174.____ Я, зазвичай, ставлю мої потреби вище від потреб інших. 
175.____ Я часто помічаю, що настільки зайнятий (-а) своїми справами, що не маю часу для друзів чи сім’ї. 
176.____ Люди часто говорять мені, що я надмірно контролюю спосіб, в який виконуються завдання. 
177.____ Я дуже дратуюсь, коли люди не роблять те, що я їх прошу. 
178.____ Я не можу терпіти, коли інші говорять мені, що робити. 
*et
179.____ Мені надзвичайно важко припинити вживати алкоголь, курити, переїдати чи відмовитись від інших шкідливих звичок.  
180.____ Мені важко організувати себе, щоб завершити рутинне або нудне завдання.  
181.____ Я часто дозволяю собі проявити такі емоції чи імпульсивні реакції, які спричиняють мені проблеми або ранять інших людей. 
182.____ Якщо я не можу досягнути мети, то швидко розчаровуюсь і відмовляюсь від неї. 
183.____ Мені важко пожертвувати миттєвим задоволенням задля досягнення довготривалої мети. 
184.____ Часто буває так, що коли я починаю злитись, то вже не можу себе контролювати.  
185.____ Я маю схильність виконувати надто багато роботи, навіть якщо знаю, що для мене це погано. 
186.____ Я дуже швидко знуджуюсь, втрачаю інтерес. 
187.____ Якщо виявляється, що завдання важке, я, зазвичай, не завершую його до кінця. 
188.____ Я не можу довго концентруватись на чомусь. 
189.____ Я не можу змушувати себе робити речі, які не приносять мені задоволення, навіть якщо я знаю, що це заради мого добра. 
190.____ Я виходжу з себе навіть через найменшу образу. 
191.____ Мені рідко вдавалося притримуватись мого рішення. 
192.____ Я майже ніколи не стримую себе від прояву моїх справжніх почуттів та емоцій, незалежно від того, чого мені це буде коштувати. 
193.____ Я часто дію імпульсивно, про що пізніше шкодую. 
*is 
194.____ Для мене важливо подобатись майже всім моїм знайомим. 
195.____ Я підлаштовуюсь під тих, з ким перебуваю для того, щоб більше їм подобатись. 
196.____ Я прикладаю великих зусиль для того, щоб мене прийняли, щоб мене поважали. 
197.____ Моя самооцінка переважно ґрунтується на думці інших людей про мене. 
198.____ Гроші і знайомства з важливими людьми додають мені почуття власної цінності. 
199.____ Я багато часу приділяю своєму зовнішньому вигляду, щоб люди оцінили мене. 
200.____ Досягнення є більш цінними для мене, якщо їх хтось помічає. 
201.____ Я настільки зосереджений (-на) на тому, щоб бути як всі, що інколи не знаю, ким я є. 
202.____ Мені важко ставити власні цілі, не беручи до уваги думку інших про мій вибір. 
203.____ Коли я думаю про важливі рішення в моєму житті, то бачу, що у їх прийнятті для мене було ключовим, щоби ці рішення були схвалені іншими людьми. 
204.____ Навіть якщо мені хтось не подобається, я все одно хочу подобатись тій особі. 205.____ Я почуваюсь менш важливим (-ою), якщо не отримую багато уваги від інших. 
206.____ Якщо я виступаю на засіданні або якщо мене представлено на зборах, то я очікую схвалення і визнання. 
207.____ Похвала і компліменти дають мені відчуття цінності. 
*as 
208.____ Навіть якщо все йде добре, я думаю, що це тимчасово. 
209.____ Якщо стається щось добре, я хвилююсь, що після цього може статись щось погане. 
210.____ Неможливо бути надмірно ретельним; майже завжди щось піде не так. 
211.____ Незважаючи на те, як багато я працюю, я боюсь фінансового краху. 
212.____ Я хвилююсь, що неправильне рішення може призвести до катастрофи. 
213.____ Я часто надмірно переймаюсь через незначні рішення, тому що думаю, що їх наслідки можуть бути дуже серйозними. 
214.____ Я почуваюся краще, коли подумки готую себе до того, що мені нічого не вийде, аніж робити щось, а потім бути розчарованим, якщо щось піде не так. 
215.____ Я концентруюсь більше на негативних моментах та подіях життя, ніж на позитивних. 
216.____ Я більше песиміст, ніж оптиміст. 
217.____ Близькі мені люди вважають, що я надмірно за все переживаю. 
218.____ Якщо люди занадто захоплені чимось, мені стає незручно і я відчуваю, що маю застерегти їх про те, що щось може піти не так.  *np 
219.____ Якщо я роблю помилку, то заслуговую на покарання. 
220.____ Якщо я не стараюсь з усіх сил, мені слід очікувати невдачі. 
221.____ Мені немає пробачення, якщо я зроблю помилку. 
222.____ Люди, які не виконують чесно свою частину роботи, повинні бути покарані. 
223.____ Здебільшого, я не приймаю виправдань інших. Вони просто не хочуть взяти на себе відповідальність і «заплатити» за наслідки. 
224.____ Якщо я не виконую роботу добре, то повинен (-на) постраждати від наслідків.
225.____ Я часто думаю про помилки, які зробив (-ла), і відчуваю злість на себе. 
226.____ Коли люди роблять щось погане, мені важко сказати “я тобі пробачаю і давай забудемо про це”. 
227.____ Я тримаю образу навіть після того, як людина попросила пробачення. 
228.____ Мене дратує, коли я бачу, що людині все дуже легко сходить з рук. 
229.____ Мене дратує, коли люди виправдовуються або звинувачують інших у своїх проблемах.  
230.____ Немає значення, чому я зробив (-ла) помилку; коли я роблю щось не так, я маю за це заплатити.  
231.____ Я часто собі докоряю за багато речей, які я зробив (-ла) не так.`;

export const getQuestions = () => {
  return questions
    .split('____')
    .slice(1)
    .map((item, index, array) => {
      const newQuestion = item.replaceAll('_', '').trim();

      if (index === array.length - 1) {
        return newQuestion;
      }

      const newSting = newQuestion.slice(0, -6);

      return newSting;
    });
};
